In [4]:
import pandas as pd

In [34]:
df=pd.read_excel(r"C:\Users\asus\Desktop\Datasets\Raw data .xlsx")
df

    Id      Name  Lastname  Salary Department  Mobile no.
0    1     Anshu    Rajput   90000      Sales  8595787610
1    2    Manish     Kumar   62000  Marketing  8595787611
2    3     Aadil      Khan   70000    Finance  8595787612
3    4   Chandan    Thakur   80000         IT  8595787613
4    5      Aman     Anand   20000      Sales  8595787614
5    6     Badal     Singh   65000  Marketing  8595787615
6    7      Anil     Yadav   55000    Finance  8595787616
7    8     Akash     Verma   75000         IT  8595787617
8    9      Yash  Kushwaha   25000      Sales  8595787618
9   10  Abhishek     Yadav   95000  Marketing  8595787619
10  11   Aaditya     Yadav   10000    Finance  8595787620
11  12     Daksh   Chauhan   66000         IT  8595787621
12  13     Ayush     Singh   30000      Sales  8595787622
13  14      Arun     Singh   89000  Marketing  8595787623
14  15    Ashish     Rawat   90000    Finance  8595787624
15  16    Shivam    Thakur   91000         IT  8595787625
16  17     Swati    Thakur   92000      Sales  8595787626
17  18    Vineet      Ojha   93000  Marketing  8595787627
18  19    Sourav    Mathur   94000    Finance  8595787628
19  20    Yogesh    Sharma   95000         IT  8595787629

In [36]:
df['Taxsalary']=df['Salary']*0.8
df

    Id      Name  Lastname  Salary Department  Mobile no.  Taxsalary
0    1     Anshu    Rajput   90000      Sales  8595787610    72000.0
1    2    Manish     Kumar   62000  Marketing  8595787611    49600.0
2    3     Aadil      Khan   70000    Finance  8595787612    56000.0
3    4   Chandan    Thakur   80000         IT  8595787613    64000.0
4    5      Aman     Anand   20000      Sales  8595787614    16000.0
5    6     Badal     Singh   65000  Marketing  8595787615    52000.0
6    7      Anil     Yadav   55000    Finance  8595787616    44000.0
7    8     Akash     Verma   75000         IT  8595787617    60000.0
8    9      Yash  Kushwaha   25000      Sales  8595787618    20000.0
9   10  Abhishek     Yadav   95000  Marketing  8595787619    76000.0
10  11   Aaditya     Yadav   10000    Finance  8595787620     8000.0
11  12     Daksh   Chauhan   66000         IT  8595787621    52800.0
12  13     Ayush     Singh   30000      Sales  8595787622    24000.0
13  14      Arun     Singh   89000  Marketing  8595787623    71200.0
14  15    Ashish     Rawat   90000    Finance  8595787624    72000.0
15  16    Shivam    Thakur   91000         IT  8595787625    72800.0
16  17     Swati    Thakur   92000      Sales  8595787626    73600.0
17  18    Vineet      Ojha   93000  Marketing  8595787627    74400.0
18  19    Sourav    Mathur   94000    Finance  8595787628    75200.0
19  20    Yogesh    Sharma   95000         IT  8595787629    76000.0

In [8]:
one=pd.DataFrame({
    'id':[1,2,3,4,5],
    'Name':['Akash','Anshu','Aadil','Badal','Chandan'],
    'subject_id':['sub1','sub2','sub3','sub4','sub5']})
one

   id     Name subject_id
0   1    Akash       sub1
1   2    Anshu       sub2
2   3    Aadil       sub3
3   4    Badal       sub4
4   5  Chandan       sub5

In [9]:
two=pd.DataFrame({
    'id':[1,2,3,14,15],
    'Name':['Anil','Aditya','Aadil','Bhupesh','Deepak'],
    'subject_id':['sub1','sub2','sub3','sub4','sub5']})
two

   id     Name subject_id
0   1     Anil       sub1
1   2   Aditya       sub2
2   3    Aadil       sub3
3  14  Bhupesh       sub4
4  15   Deepak       sub5

In [10]:
# joins in pandas
# Left join  (It can show the full left side data and compair with right side data.)
# Right join  (It can show the full right side data and compair with left side data.)
# Inner join  (It can show the common data in both left and right side data.)
# Outer join  (It can show the overall compairsion of left or right both side data at a time.)

In [7]:
# By default is apply inner join.
print(pd.merge(one,two,on='id'))

   id Name_x subject_id_x  Name_y subject_id_y
0   1  Akash         sub1    Anil         sub1
1   2  Anshu         sub2  Aditya         sub2
2   3  Aadil         sub3   Aadil         sub3

In [8]:
print(pd.merge(one,two,on='Name',how='left'))

   id_x     Name subject_id_x  id_y subject_id_y
0     1    Akash         sub1   NaN          NaN
1     2    Anshu         sub2   NaN          NaN
2     3    Aadil         sub3   3.0         sub3
3     4    Badal         sub4   NaN          NaN
4     5  Chandan         sub5   NaN          NaN

In [9]:
print(pd.merge(one,two,on='id',how='right'))

   id Name_x subject_id_x   Name_y subject_id_y
0   1  Akash         sub1     Anil         sub1
1   2  Anshu         sub2   Aditya         sub2
2   3  Aadil         sub3    Aadil         sub3
3  14    NaN          NaN  Bhupesh         sub4
4  15    NaN          NaN   Deepak         sub5

In [10]:
print(pd.merge(one,two,on='id',how='inner'))

   id Name_x subject_id_x  Name_y subject_id_y
0   1  Akash         sub1    Anil         sub1
1   2  Anshu         sub2  Aditya         sub2
2   3  Aadil         sub3   Aadil         sub3

In [11]:
print(pd.merge(one,two,on='id',how='outer'))

   id   Name_x subject_id_x   Name_y subject_id_y
0   1    Akash         sub1     Anil         sub1
1   2    Anshu         sub2   Aditya         sub2
2   3    Aadil         sub3    Aadil         sub3
3   4    Badal         sub4      NaN          NaN
4   5  Chandan         sub5      NaN          NaN
5  14      NaN          NaN  Bhupesh         sub4
6  15      NaN          NaN   Deepak         sub5

In [12]:
# apply these join methods behalf of two coloumns.
print(pd.merge(one,two,on=['id','Name']))

   id   Name subject_id_x subject_id_y
0   3  Aadil         sub3         sub3

In [13]:
print(pd.merge(one,two,on=['id','Name'],how='outer'))

   id     Name subject_id_x subject_id_y
0   1    Akash         sub1          NaN
1   1     Anil          NaN         sub1
2   2   Aditya          NaN         sub2
3   2    Anshu         sub2          NaN
4   3    Aadil         sub3         sub3
5   4    Badal         sub4          NaN
6   5  Chandan         sub5          NaN
7  14  Bhupesh          NaN         sub4
8  15   Deepak          NaN         sub5

In [14]:
# Group by: A groupby operation involves some combination of splitting the object, applying a function, and combining the results. 
#           This can be used to group large amounts of data and compute operations on these groups. 
#            Parameters: bymapping, function, label, pd.Grouper or list of such. Used to determine the groups for the groupby.

In [15]:
df

    Id      Name  Lastname  Salary Department  Mobile no.
0    1     Anshu    Rajput   90000      Sales  8595787610
1    2    Manish     Kumar   62000  Marketing  8595787611
2    3     Aadil      Khan   70000    Finance  8595787612
3    4   Chandan    Thakur   80000         IT  8595787613
4    5      Aman     Anand   20000      Sales  8595787614
5    6     Badal     Singh   65000  Marketing  8595787615
6    7      Anil     Yadav   55000    Finance  8595787616
7    8     Akash     Verma   75000         IT  8595787617
8    9      Yash  Kushwaha   25000      Sales  8595787618
9   10  Abhishek     Yadav   95000  Marketing  8595787619
10  11   Aaditya     Yadav   10000    Finance  8595787620
11  12     Daksh   Chauhan   66000         IT  8595787621
12  13     Ayush     Singh   30000      Sales  8595787622
13  14      Arun     Singh   89000  Marketing  8595787623
14  15    Ashish     Rawat   90000    Finance  8595787624
15  16    Shivam    Thakur   91000         IT  8595787625
16  17     Swati    Thakur   92000      Sales  8595787626
17  18    Vineet      Ojha   93000  Marketing  8595787627
18  19    Sourav    Mathur   94000    Finance  8595787628
19  20    Yogesh    Sharma   95000         IT  8595787629

In [35]:
h=df.groupby('Department')
h

In [36]:
for i,j in h:
    print(i)
    print(j)

Finance
    Id     Name Lastname  Salary Department  Mobile no.
2    3    Aadil     Khan   70000    Finance  8595787612
6    7     Anil    Yadav   55000    Finance  8595787616
10  11  Aaditya    Yadav   10000    Finance  8595787620
14  15   Ashish    Rawat   90000    Finance  8595787624
18  19   Sourav   Mathur   94000    Finance  8595787628
IT
    Id     Name Lastname  Salary Department  Mobile no.
3    4  Chandan   Thakur   80000         IT  8595787613
7    8    Akash    Verma   75000         IT  8595787617
11  12    Daksh  Chauhan   66000         IT  8595787621
15  16   Shivam   Thakur   91000         IT  8595787625
19  20   Yogesh   Sharma   95000         IT  8595787629
Marketing
    Id      Name Lastname  Salary Department  Mobile no.
1    2    Manish    Kumar   62000  Marketing  8595787611
5    6     Badal    Singh   65000  Marketing  8595787615
9   10  Abhishek    Yadav   95000  Marketing  8595787619
13  14      Arun    Singh   89000  Marketing  8595787623
17  18    Vineet     Ojha   93000  Marketing  8595787627
Sales
    Id   Name  Lastname  Salary Department  Mobile no.
0    1  Anshu    Rajput   90000      Sales  8595787610
4    5   Aman     Anand   20000      Sales  8595787614
8    9   Yash  Kushwaha   25000      Sales  8595787618
12  13  Ayush     Singh   30000      Sales  8595787622
16  17  Swati    Thakur   92000      Sales  8595787626

In [13]:
b=h['Salary'].sum()
b

Department
Finance      319000
IT           407000
Marketing    404000
Sales        257000
Name: Salary, dtype: int64

In [14]:
type(b)

pandas.core.series.Series

In [41]:
# Now we can change this data type in dataframe for performing the pandas methods.
k=pd.DataFrame(b)
k

            Salary
Department
Finance     319000
IT          407000
Marketing   404000
Sales       257000

In [44]:
k.sort_values('Salary',ascending=False)

            Salary
Department
IT          407000
Marketing   404000
Finance     319000
Sales       257000

In [43]:
# Highest salary find by dapartment wise.but at this point there is a situation 
# when two or more department can have same values then the data can be only once,so we can use another method to achieve this. 
k.sort_values('Salary',ascending=False).head(1)

            Salary
Department
IT          407000

In [50]:
k[k.Salary==k['Salary'].max()]

            Salary
Department
IT          407000

In [52]:
# Now Group by also perform behalf of two columns.
h2=df.groupby(['Department','Lastname'])
h2

In [53]:
for i,j in h2:
    print(i)
    print(j)

('Finance', 'Khan')
   Id   Name Lastname  Salary Department  Mobile no.
2   3  Aadil     Khan   70000    Finance  8595787612
('Finance', 'Mathur')
    Id    Name Lastname  Salary Department  Mobile no.
18  19  Sourav   Mathur   94000    Finance  8595787628
('Finance', 'Rawat')
    Id    Name Lastname  Salary Department  Mobile no.
14  15  Ashish    Rawat   90000    Finance  8595787624
('Finance', 'Yadav')
    Id     Name Lastname  Salary Department  Mobile no.
6    7     Anil    Yadav   55000    Finance  8595787616
10  11  Aaditya    Yadav   10000    Finance  8595787620
('IT', 'Chauhan')
    Id   Name Lastname  Salary Department  Mobile no.
11  12  Daksh  Chauhan   66000         IT  8595787621
('IT', 'Sharma')
    Id    Name Lastname  Salary Department  Mobile no.
19  20  Yogesh   Sharma   95000         IT  8595787629
('IT', 'Thakur')
    Id     Name Lastname  Salary Department  Mobile no.
3    4  Chandan   Thakur   80000         IT  8595787613
15  16   Shivam   Thakur   91000         IT  8595787625
('IT', 'Verma')
   Id   Name Lastname  Salary Department  Mobile no.
7   8  Akash    Verma   75000         IT  8595787617
('Marketing', 'Kumar')
   Id    Name Lastname  Salary Department  Mobile no.
1   2  Manish    Kumar   62000  Marketing  8595787611
('Marketing', 'Ojha')
    Id    Name Lastname  Salary Department  Mobile no.
17  18  Vineet     Ojha   93000  Marketing  8595787627
('Marketing', 'Singh')
    Id   Name Lastname  Salary Department  Mobile no.
5    6  Badal    Singh   65000  Marketing  8595787615
13  14   Arun    Singh   89000  Marketing  8595787623
('Marketing', 'Yadav')
   Id      Name Lastname  Salary Department  Mobile no.
9  10  Abhishek    Yadav   95000  Marketing  8595787619
('Sales', 'Anand')
   Id  Name Lastname  Salary Department  Mobile no.
4   5  Aman    Anand   20000      Sales  8595787614
('Sales', 'Kushwaha')
   Id  Name  Lastname  Salary Department  Mobile no.
8   9  Yash  Kushwaha   25000      Sales  8595787618
('Sales', 'Rajput')
   Id   Name Lastname  Salary Department  Mobile no.
0   1  Anshu   Rajput   90000      Sales  8595787610
('Sales', 'Singh')
    Id   Name Lastname  Salary Department  Mobile no.
12  13  Ayush    Singh   30000      Sales  8595787622
('Sales', 'Thakur')
    Id   Name Lastname  Salary Department  Mobile no.
16  17  Swati   Thakur   92000      Sales  8595787626

In [54]:
h2['Salary'].count()

Department  Lastname
Finance     Khan        1
            Mathur      1
            Rawat       1
            Yadav       2
IT          Chauhan     1
            Sharma      1
            Thakur      2
            Verma       1
Marketing   Kumar       1
            Ojha        1
            Singh       2
            Yadav       1
Sales       Anand       1
            Kushwaha    1
            Rajput      1
            Singh       1
            Thakur      1
Name: Salary, dtype: int64

In [11]:
h=df.groupby('Department')
h

In [15]:
k=pd.DataFrame(b)
k

            Salary
Department
Finance     319000
IT          407000
Marketing   404000
Sales       257000

In [17]:
k[k['Salary']>200000]

            Salary
Department
Finance     319000
IT          407000
Marketing   404000
Sales       257000

In [19]:
k[(k['Salary']>200000)&(k['Salary']<300000)]

            Salary
Department
Sales       257000

In [21]:
p=h['Salary'].count()
p

Department
Finance      5
IT           5
Marketing    5
Sales        5
Name: Salary, dtype: int64

In [23]:
m=pd.DataFrame(p)
m

            Salary
Department
Finance          5
IT               5
Marketing        5
Sales            5

In [24]:
t=pd.concat([k,m],axis=1)
t

            Salary  Salary
Department
Finance     319000       5
IT          407000       5
Marketing   404000       5
Sales       257000       5

In [25]:
df[['Department','Salary']].pivot_table(index='Department')

             Salary
Department
Finance     63800.0
IT          81400.0
Marketing   80800.0
Sales       51400.0

In [37]:
pd.set_option('display.max_column',None)
df[['Department','Salary','Taxsalary','Lastname']].pivot_table(index='Department',columns='Lastname')

             Salary                                                        \
Lastname      Anand  Chauhan     Khan    Kumar Kushwaha   Mathur     Ojha
Department
Finance         NaN      NaN  70000.0      NaN      NaN  94000.0      NaN
IT              NaN  66000.0      NaN      NaN      NaN      NaN      NaN
Marketing       NaN      NaN      NaN  62000.0      NaN      NaN  93000.0
Sales       20000.0      NaN      NaN      NaN  25000.0      NaN      NaN

                                                                           \
Lastname     Rajput    Rawat   Sharma    Singh   Thakur    Verma    Yadav
Department
Finance         NaN  90000.0      NaN      NaN      NaN      NaN  32500.0
IT              NaN      NaN  95000.0      NaN  85500.0  75000.0      NaN
Marketing       NaN      NaN      NaN  77000.0      NaN      NaN  95000.0
Sales       90000.0      NaN      NaN  30000.0  92000.0      NaN      NaN

           Taxsalary                                                        \
Lastname       Anand  Chauhan     Khan    Kumar Kushwaha   Mathur     Ojha
Department
Finance          NaN      NaN  56000.0      NaN      NaN  75200.0      NaN
IT               NaN  52800.0      NaN      NaN      NaN      NaN      NaN
Marketing        NaN      NaN      NaN  49600.0      NaN      NaN  74400.0
Sales        16000.0      NaN      NaN      NaN  20000.0      NaN      NaN


Lastname     Rajput    Rawat   Sharma    Singh   Thakur    Verma    Yadav
Department
Finance         NaN  72000.0      NaN      NaN      NaN      NaN  26000.0
IT              NaN      NaN  76000.0      NaN  68400.0  60000.0      NaN
Marketing       NaN      NaN      NaN  61600.0      NaN      NaN  76000.0
Sales       72000.0      NaN      NaN  24000.0  73600.0      NaN      NaN

In [38]:
# For remove the NaN and print 0 with that place.
pd.set_option('display.max_column',None)
df[['Department','Salary','Taxsalary','Lastname']].pivot_table(index='Department',columns='Lastname',fill_value=0,aggfunc='count')

           Salary                                                              \
Lastname    Anand Chauhan Khan Kumar Kushwaha Mathur Ojha Rajput Rawat Sharma
Department
Finance         0       0    1     0        0      1    0      0     1      0
IT              0       1    0     0        0      0    0      0     0      1
Marketing       0       0    0     1        0      0    1      0     0      0
Sales           1       0    0     0        1      0    0      1     0      0

                                    Taxsalary                              \
Lastname   Singh Thakur Verma Yadav     Anand Chauhan Khan Kumar Kushwaha
Department
Finance        0      0     0     2         0       0    1     0        0
IT             0      2     1     0         0       1    0     0        0
Marketing      2      0     0     1         0       0    0     1        0
Sales          1      1     0     0         1       0    0     0        1


Lastname   Mathur Ojha Rajput Rawat Sharma Singh Thakur Verma Yadav
Department
Finance         1    0      0     1      0     0      0     0     2
IT              0    0      0     0      1     0      2     1     0
Marketing       0    1      0     0      0     2      0     0     1
Sales           0    0      1     0      0     1      1     0     0

In [39]:
# For maximum salary of different department.
df[['Department','Salary','Taxsalary',]].pivot_table(index='Department',fill_value=0,aggfunc='max')

            Salary  Taxsalary
Department
Finance      94000    75200.0
IT           95000    76000.0
Marketing    95000    76000.0
Sales        92000    73600.0

In [40]:
# for print the sum of total rows and columns.
df[['Department','Salary','Taxsalary',]].pivot_table(index='Department',fill_value=0,aggfunc='sum',margins=True)

             Salary  Taxsalary
Department
Finance      319000   255200.0
IT           407000   325600.0
Marketing    404000   323200.0
Sales        257000   205600.0
All         1387000  1109600.0

In [49]:
import numpy as np

In [50]:
ipl_data = {'Team':['Riders','Riders','Devils','Devils','Kings','Kings','Kings','Kings','Riders','Royals','Royals','Royals'],
            'Rank':[1,2,2,3,3,4,1,1,2,4,1,2],
            'Year':[2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
            'Points':[876,789,863,673,741,812,756,788,694,701,884,690]}
df2= pd.DataFrame(ipl_data)
df2

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    Kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     884
11  Royals     2  2017     690

In [51]:
df2.pivot_table(index='Team',columns='Year',aggfunc='sum',fill_value=0,margins=True)

       Points                         Rank
Year     2014  2015  2016  2017   All 2014 2015 2016 2017 All
Team
Devils    863   673     0     0  1536    2    3    0    0   5
Kings     741   812   756   788  3097    3    4    1    1   9
Riders    876   789   694     0  2359    1    2    2    0   5
Royals    701   884     0   690  2275    4    1    0    2   7
All      3181  3158  1450  1478  9267   10   10    3    3  26

In [52]:
pd.set_option('display.max_column',None)
df[['Department','Salary','Taxsalary','Lastname']].pivot_table(index='Department',columns='Lastname',fill_value=0,aggfunc='sum',margin=True)

KeyError: "None of [Index(['Department', 'Salary', 'Taxsalary', 'Lastname'], dtype='object')] are in the [columns]"